package com.Practice.mydemmo.TrainingCouser.EmploymentClass.FirstStage.day6_CollectionsIteratorArrayList;

/**
 * 数据结构
 * 数据存储的常用结构有：
 * 栈、队列、数组、链表和红黑树
 * ---------------------
 * 栈：
 * stack,又称堆栈，它是运算受限的线性表，其限制是仅允许在标的一端进行插入和删除操作，不允许在其他任何位 置进行添加、查找、删除等操作。
 * 先进后出（即，存进去的元素，要在后它后面的元素依次取出后，才能取出该元素）。例如，子弹压进弹夹，先压进 去的子弹在下面，后压进去的子弹在上面，当开枪时，先弹出上面的子弹，然后才能弹出下面的子弹。
 * 栈的入口、出口的都是栈的顶端位置。
 * 压栈：就是存元素。即，把元素存储到栈的顶端位置，栈中已有元素依次向栈底方向移动一个位置。
 * 弹栈：就是取元素。即，把栈的顶端位置元素取出，栈中已有元素依次向栈顶方向移动一个位置。
 * ---------------------
 * 队列：
 * queue,简称队，它同堆栈一样，也是一种运算受限的线性表，其限制是仅允许在表的一端进行插入，而在表的 另一端进行删除。
 * 先进先出（即，存进去的元素，要在后它前面的元素依次取出后，才能取出该元素）。例如，小火车过山洞，车头先 进去，车尾后进去；车头先出来，车尾后出来。
 * 队列的入口、出口各占一侧。
 * ---------------------
 * 数组:
 * Array,是有序的元素序列，数组是在内存中开辟一段连续的空间，并在此空间存放元素。就像是一排出租屋，有 100个房间，从001到100每个房间都有固定编号，通过编号就可以快速找到租房子的人。
 * 查找元素快：通过索引，可以快速访问指定位置的元素。
 * 增删元素慢 :指定索引位置增加元素：需要创建一个新数组，将指定新元素存储在指定索引位置，再把原数组元素根据索引，复制到新数组对应索引的位置。
 * ---------------------
 * 链表:
 * linked list,由一系列结点node（链表中每一个元素称为结点）组成，结点可以在运行时i动态生成。
 * 每个结点包 括两个部分：一个是存储数据元素的数据域，另一个是存储下一个结点地址的指针域。
 * 我们常说的链表结构有 单向链表 与 双向链表
 * 多个结点之间，通过地址进行连接。例如，多个人手拉手，每个人使用自己的右手拉住下个人的左手，依次类推，这 样多个人就连在一起了。
 * 查找元素慢：想查找某个元素，需要通过连接的节点，依次向后查找指定元素
 * 增删元素快
 */
public class DataStructure {
}
